#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/9ceca4bc-6269-45d2-aa47-d5e37d19f40c/terraform-bin show -no-color tfplan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.network.azurerm_virtual_network.this has changed
  ~ resource "azurerm_virtual_network" "this" {
        id                      = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/virtualNetworks/vnet-hub-scenario1-wus3"
        name                    = "vnet-hub-scenario1-wus3"
      ~ subnet                  = [
          + {
              + address_prefix = "10.242.0.0/26"
              + id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/virtualNetworks/vnet-hub-scenario1-wus3/subnets/AzureFirewallSubnet"
              + name           = "AzureFirewallSubnet"
              + security_group = ""
            },
          + {
              + address_prefix = "10.242.0.64/26"
              + id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/virtualNetworks/vnet-hub-scenario1-wus3/subnets/AzureBastionSubnet"
              + name           = "AzureBastionSubnet"
              + security_group = ""
            },
        ]
      + tags                    = {}
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurecaf_name.bastion_host will be destroyed
  # (because azurecaf_name.bastion_host is not in configuration)
  - resource "azurecaf_name" "bastion_host" {
      - clean_input   = true -> null
      - id            = "gggewsruqgiwnjwa" -> null
      - name          = "hub-scenario1" -> null
      - passthrough   = false -> null
      - random_length = 0 -> null
      - resource_type = "azurerm_bastion_host" -> null
      - result        = "bast-hub-scenario1-wus3" -> null
      - results       = {} -> null
      - separator     = "-" -> null
      - suffixes      = [
          - "wus3",
        ] -> null
      - use_slug      = true -> null
    }

  # azurecaf_name.caf_name_hub_rg will be created
  + resource "azurecaf_name" "caf_name_hub_rg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "eslz2"
      + passthrough   = false
      + prefixes      = [
          + "sec-baseline-1-hub",
          + "westus3",
        ]
      + random_length = 0
      + resource_type = "azurerm_resource_group"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # azurecaf_name.firewall will be destroyed
  # (because azurecaf_name.firewall is not in configuration)
  - resource "azurecaf_name" "firewall" {
      - clean_input   = true -> null
      - id            = "atqhstfaibxdnjav" -> null
      - name          = "hub-scenario1" -> null
      - passthrough   = false -> null
      - random_length = 0 -> null
      - resource_type = "azurerm_firewall" -> null
      - result        = "fw-hub-scenario1-wus3" -> null
      - results       = {} -> null
      - separator     = "-" -> null
      - suffixes      = [
          - "wus3",
        ] -> null
      - use_slug      = true -> null
    }

  # azurecaf_name.law will be destroyed
  # (because azurecaf_name.law is not in configuration)
  - resource "azurecaf_name" "law" {
      - clean_input   = true -> null
      - id            = "fqnobcgpjpovkway" -> null
      - name          = "hub-scenario1" -> null
      - passthrough   = false -> null
      - random_length = 0 -> null
      - resource_type = "azurerm_log_analytics_workspace" -> null
      - result        = "log-hub-scenario1-wus3" -> null
      - results       = {} -> null
      - separator     = "-" -> null
      - suffixes      = [
          - "wus3",
        ] -> null
      - use_slug      = true -> null
    }

  # azurecaf_name.resource_group will be destroyed
  # (because azurecaf_name.resource_group is not in configuration)
  - resource "azurecaf_name" "resource_group" {
      - clean_input   = true -> null
      - id            = "sdhamjahaycopevr" -> null
      - name          = "hub-scenario1" -> null
      - passthrough   = false -> null
      - random_length = 0 -> null
      - resource_type = "azurerm_resource_group" -> null
      - result        = "rg-hub-scenario1-wus3" -> null
      - results       = {} -> null
      - separator     = "-" -> null
      - suffixes      = [
          - "wus3",
        ] -> null
      - use_slug      = true -> null
    }

  # azurecaf_name.vnet will be destroyed
  # (because azurecaf_name.vnet is not in configuration)
  - resource "azurecaf_name" "vnet" {
      - clean_input   = true -> null
      - id            = "eayygfcnmpfqsowx" -> null
      - name          = "hub-scenario1" -> null
      - passthrough   = false -> null
      - random_length = 0 -> null
      - resource_type = "azurerm_virtual_network" -> null
      - result        = "vnet-hub-scenario1-wus3" -> null
      - results       = {} -> null
      - separator     = "-" -> null
      - suffixes      = [
          - "wus3",
        ] -> null
      - use_slug      = true -> null
    }

  # azurerm_log_analytics_workspace.law will be destroyed
  # (because azurerm_log_analytics_workspace.law is not in configuration)
  - resource "azurerm_log_analytics_workspace" "law" {
      - allow_resource_only_permissions = true -> null
      - cmk_for_query_forced            = false -> null
      - daily_quota_gb                  = -1 -> null
      - id                              = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.OperationalInsights/workspaces/log-hub-scenario1-wus3" -> null
      - internet_ingestion_enabled      = true -> null
      - internet_query_enabled          = true -> null
      - local_authentication_disabled   = false -> null
      - location                        = "westus3" -> null
      - name                            = "log-hub-scenario1-wus3" -> null
      - primary_shared_key              = (sensitive value) -> null
      - resource_group_name             = "rg-hub-scenario1-wus3" -> null
      - retention_in_days               = 30 -> null
      - secondary_shared_key            = (sensitive value) -> null
      - sku                             = "PerGB2018" -> null
      - tags                            = {} -> null
      - workspace_id                    = "2b9150ce-64a2-4a6d-885e-cd7dfd9e8153" -> null
    }

  # azurerm_resource_group.hub must be replaced
-/+ resource "azurerm_resource_group" "hub" {
      ~ id       = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3" -> (known after apply)
      ~ name     = "rg-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement
      ~ tags     = {
          + "Environment" = "prod"
          + "Owner"       = "cloudops@contoso.com"
          + "Project"     = "[Scenario 1: HUB] App Service Landing Zone Accelerator"
          + "Terraform"   = "true"
          - "terraform"   = "true" -> null
        }
        # (1 unchanged attribute hidden)
    }

  # module.bastion[0].azurecaf_name.bastion_pip will be destroyed
  # (because azurecaf_name.bastion_pip is not in configuration)
  - resource "azurecaf_name" "bastion_pip" {
      - clean_input   = true -> null
      - id            = "qwntecdiprlwaonl" -> null
      - name          = "bast-hub-scenario1-wus3" -> null
      - passthrough   = false -> null
      - random_length = 0 -> null
      - resource_type = "azurerm_public_ip" -> null
      - result        = "pip-bast-hub-scenario1-wus3" -> null
      - results       = {} -> null
      - separator     = "-" -> null
      - use_slug      = true -> null
    }

  # module.bastion[0].azurecaf_name.caf_name_bastion will be created
  + resource "azurecaf_name" "caf_name_bastion" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "eslz2"
      + passthrough   = false
      + prefixes      = [
          + "sec-baseline-1-hub",
          + "westus3",
        ]
      + random_length = 0
      + resource_type = "azurerm_virtual_network"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.bastion[0].azurecaf_name.caf_name_pip will be created
  + resource "azurecaf_name" "caf_name_pip" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "eslz2"
      + passthrough   = false
      + prefixes      = [
          + "sec-baseline-1-hub",
          + "westus3",
        ]
      + random_length = 0
      + resource_type = "azurerm_public_ip"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.bastion[0].azurerm_bastion_host.bastion must be replaced
-/+ resource "azurerm_bastion_host" "bastion" {
      ~ dns_name               = "bst-69efc60e-54e0-4ac8-b44f-4347f67dc108.bastion.azure.com" -> (known after apply)
      ~ id                     = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/bastionHosts/bast-hub-scenario1-wus3" -> (known after apply)
      ~ name                   = "bast-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement
      ~ resource_group_name    = "rg-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement
      ~ tags                   = {
          + "Environment" = "prod"
          + "Owner"       = "cloudops@contoso.com"
          + "Project"     = "[Scenario 1: HUB] App Service Landing Zone Accelerator"
          + "Terraform"   = "true"
          + "module"      = "bastion"
        }
        # (8 unchanged attributes hidden)

      ~ ip_configuration {
            name                 = "bastionHostIpConfiguration"
          ~ public_ip_address_id = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/publicIPAddresses/pip-bast-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement
          ~ subnet_id            = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/virtualNetworks/vnet-hub-scenario1-wus3/subnets/AzureBastionSubnet" # forces replacement -> (known after apply) # forces replacement
        }
    }

  # module.bastion[0].azurerm_public_ip.bastion_pip must be replaced
-/+ resource "azurerm_public_ip" "bastion_pip" {
      + fqdn                    = (known after apply)
      ~ id                      = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/publicIPAddresses/pip-bast-hub-scenario1-wus3" -> (known after apply)
      ~ ip_address              = "20.25.144.65" -> (known after apply)
      - ip_tags                 = {} -> null
      ~ name                    = "pip-bast-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement
      ~ resource_group_name     = "rg-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement
      ~ tags                    = {
          + "Environment" = "prod"
          + "Owner"       = "cloudops@contoso.com"
          + "Project"     = "[Scenario 1: HUB] App Service Landing Zone Accelerator"
          + "Terraform"   = "true"
          + "module"      = "bastion"
        }
      - zones                   = [] -> null
        # (7 unchanged attributes hidden)
    }

  # module.firewall[0].azurecaf_name.caf_name_firewall will be created
  + resource "azurecaf_name" "caf_name_firewall" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "eslz2"
      + passthrough   = false
      + prefixes      = [
          + "sec-baseline-1-hub",
          + "westus3",
        ]
      + random_length = 0
      + resource_type = "azurerm_firewall"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.firewall[0].azurecaf_name.caf_name_law[0] will be created
  + resource "azurecaf_name" "caf_name_law" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "eslz2"
      + passthrough   = false
      + prefixes      = [
          + "sec-baseline-1-hub",
          + "westus3",
        ]
      + random_length = 0
      + resource_type = "azurerm_log_analytics_workspace"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.firewall[0].azurecaf_name.caf_name_pip will be created
  + resource "azurecaf_name" "caf_name_pip" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "eslz2"
      + passthrough   = false
      + prefixes      = [
          + "sec-baseline-1-hub",
          + "westus3",
        ]
      + random_length = 0
      + resource_type = "azurerm_public_ip"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.firewall[0].azurecaf_name.firewall_pip will be destroyed
  # (because azurecaf_name.firewall_pip is not in configuration)
  - resource "azurecaf_name" "firewall_pip" {
      - clean_input   = true -> null
      - id            = "buncvpcbdyqgwdik" -> null
      - name          = "fw-hub-scenario1-wus3" -> null
      - passthrough   = false -> null
      - random_length = 0 -> null
      - resource_type = "azurerm_public_ip" -> null
      - result        = "pip-fw-hub-scenario1-wus3" -> null
      - results       = {} -> null
      - separator     = "-" -> null
      - use_slug      = true -> null
    }

  # module.firewall[0].azurerm_firewall.firewall must be replaced
-/+ resource "azurerm_firewall" "firewall" {
      - dns_servers         = [] -> null
      ~ id                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/azureFirewalls/fw-hub-scenario1-wus3" -> (known after apply)
      ~ name                = "fw-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement
      - private_ip_ranges   = [] -> null
      ~ resource_group_name = "rg-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement
      ~ tags                = {
          + "Environment" = "prod"
          + "Owner"       = "cloudops@contoso.com"
          + "Project"     = "[Scenario 1: HUB] App Service Landing Zone Accelerator"
          + "Terraform"   = "true"
          + "module"      = "firewall"
        }
      ~ threat_intel_mode   = "Alert" -> (known after apply)
      - zones               = [] -> null
        # (3 unchanged attributes hidden)

      ~ ip_configuration {
            name                 = "firewallIpConfiguration"
          ~ private_ip_address   = "10.242.0.4" -> (known after apply)
          ~ public_ip_address_id = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/publicIPAddresses/pip-fw-hub-scenario1-wus3" -> (known after apply)
          ~ subnet_id            = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/virtualNetworks/vnet-hub-scenario1-wus3/subnets/AzureFirewallSubnet" # forces replacement -> (known after apply) # forces replacement
        }
    }

  # module.firewall[0].azurerm_firewall_application_rule_collection.azure_monitor must be replaced
-/+ resource "azurerm_firewall_application_rule_collection" "azure_monitor" {
      ~ azure_firewall_name = "fw-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement
      ~ id                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/azureFirewalls/fw-hub-scenario1-wus3/applicationRuleCollections/Azure-Monitor-FQDNs" -> (known after apply)
        name                = "Azure-Monitor-FQDNs"
      ~ resource_group_name = "rg-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)

      ~ rule {
          - fqdn_tags        = [] -> null
            name             = "allow-azure-monitor"
          - source_ip_groups = [] -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.firewall[0].azurerm_firewall_application_rule_collection.core must be replaced
-/+ resource "azurerm_firewall_application_rule_collection" "core" {
      ~ azure_firewall_name = "fw-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement
      ~ id                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/azureFirewalls/fw-hub-scenario1-wus3/applicationRuleCollections/Core-Dependencies-FQDNs" -> (known after apply)
        name                = "Core-Dependencies-FQDNs"
      ~ resource_group_name = "rg-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)

      ~ rule {
          - fqdn_tags        = [] -> null
            name             = "allow-core-apis"
          - source_ip_groups = [] -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ rule {
          - fqdn_tags        = [] -> null
            name             = "allow-developer-services"
          - source_ip_groups = [] -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ rule {
          - fqdn_tags        = [] -> null
            name             = "allow-certificate-dependencies"
          - source_ip_groups = [] -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.firewall[0].azurerm_firewall_application_rule_collection.windows_vm_devops must be replaced
-/+ resource "azurerm_firewall_application_rule_collection" "windows_vm_devops" {
      ~ azure_firewall_name = "fw-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement
      ~ id                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/azureFirewalls/fw-hub-scenario1-wus3/applicationRuleCollections/Devops-VM-Dependencies-FQDNs" -> (known after apply)
        name                = "Devops-VM-Dependencies-FQDNs"
      ~ resource_group_name = "rg-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)

      ~ rule {
          - fqdn_tags        = [] -> null
            name             = "allow-azure-ad-join"
          - source_ip_groups = [] -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ rule {
          - fqdn_tags        = [] -> null
            name             = "allow-vm-dependencies-and-tools"
          - source_ip_groups = [] -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.firewall[0].azurerm_firewall_network_rule_collection.windows_vm_devops must be replaced
-/+ resource "azurerm_firewall_network_rule_collection" "windows_vm_devops" {
      ~ azure_firewall_name = "fw-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement
      ~ id                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/azureFirewalls/fw-hub-scenario1-wus3/networkRuleCollections/Windows-VM-Connectivity-Requirements" -> (known after apply)
        name                = "Windows-VM-Connectivity-Requirements"
      ~ resource_group_name = "rg-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)

      ~ rule {
          - destination_fqdns     = [] -> null
          - destination_ip_groups = [] -> null
            name                  = "allow-kms-activation"
          - source_ip_groups      = [] -> null
            # (4 unchanged attributes hidden)
        }
      ~ rule {
          - destination_fqdns     = [] -> null
          - destination_ip_groups = [] -> null
            name                  = "allow-ntp"
          - source_ip_groups      = [] -> null
            # (4 unchanged attributes hidden)
        }
    }

  # module.firewall[0].azurerm_log_analytics_workspace.law[0] will be created
  + resource "azurerm_log_analytics_workspace" "law" {
      + allow_resource_only_permissions    = true
      + daily_quota_gb                     = -1
      + id                                 = (known after apply)
      + internet_ingestion_enabled         = true
      + internet_query_enabled             = true
      + local_authentication_disabled      = false
      + location                           = "westus3"
      + name                               = (known after apply)
      + primary_shared_key                 = (sensitive value)
      + reservation_capacity_in_gb_per_day = (known after apply)
      + resource_group_name                = (known after apply)
      + retention_in_days                  = (known after apply)
      + secondary_shared_key               = (sensitive value)
      + sku                                = "PerGB2018"
      + workspace_id                       = (known after apply)
    }

  # module.firewall[0].azurerm_monitor_diagnostic_setting.this must be replaced
-/+ resource "azurerm_monitor_diagnostic_setting" "this" {
      ~ id                             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/azureFirewalls/fw-hub-scenario1-wus3|fw-hub-scenario1-wus3-diagnostic-settings" -> (known after apply)
      ~ log_analytics_destination_type = "AzureDiagnostics" -> (known after apply)
      ~ log_analytics_workspace_id     = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.OperationalInsights/workspaces/log-hub-scenario1-wus3" -> (known after apply)
      ~ name                           = "fw-hub-scenario1-wus3-diagnostic-settings" # forces replacement -> (known after apply) # forces replacement
      ~ target_resource_id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/azureFirewalls/fw-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement

      - log {
          - category_group = "allLogs" -> null
          - enabled        = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.firewall[0].azurerm_public_ip.firewall_pip must be replaced
-/+ resource "azurerm_public_ip" "firewall_pip" {
      + fqdn                    = (known after apply)
      ~ id                      = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/publicIPAddresses/pip-fw-hub-scenario1-wus3" -> (known after apply)
      ~ ip_address              = "20.25.144.42" -> (known after apply)
      - ip_tags                 = {} -> null
      ~ name                    = "pip-fw-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement
      ~ resource_group_name     = "rg-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement
      ~ tags                    = {
          + "Environment" = "prod"
          + "Owner"       = "cloudops@contoso.com"
          + "Project"     = "[Scenario 1: HUB] App Service Landing Zone Accelerator"
          + "Terraform"   = "true"
          + "module"      = "firewall"
        }
      - zones                   = [] -> null
        # (7 unchanged attributes hidden)
    }

  # module.network.azurecaf_name.caf_name_vnet will be created
  + resource "azurecaf_name" "caf_name_vnet" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "eslz2"
      + passthrough   = false
      + prefixes      = [
          + "sec-baseline-1-hub",
          + "westus3",
        ]
      + random_length = 0
      + resource_type = "azurerm_virtual_network"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.network.azurerm_subnet.this[0] must be replaced
-/+ resource "azurerm_subnet" "this" {
      ~ enforce_private_link_endpoint_network_policies = false -> (known after apply)
      ~ enforce_private_link_service_network_policies  = false -> (known after apply)
      ~ id                                             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/virtualNetworks/vnet-hub-scenario1-wus3/subnets/AzureFirewallSubnet" -> (known after apply)
        name                                           = "AzureFirewallSubnet"
      ~ private_endpoint_network_policies_enabled      = true -> (known after apply)
      ~ private_link_service_network_policies_enabled  = true -> (known after apply)
      ~ resource_group_name                            = "rg-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      ~ virtual_network_name                           = "vnet-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.network.azurerm_subnet.this[1] must be replaced
-/+ resource "azurerm_subnet" "this" {
      ~ enforce_private_link_endpoint_network_policies = false -> (known after apply)
      ~ enforce_private_link_service_network_policies  = false -> (known after apply)
      ~ id                                             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/virtualNetworks/vnet-hub-scenario1-wus3/subnets/AzureBastionSubnet" -> (known after apply)
        name                                           = "AzureBastionSubnet"
      ~ private_endpoint_network_policies_enabled      = true -> (known after apply)
      ~ private_link_service_network_policies_enabled  = true -> (known after apply)
      ~ resource_group_name                            = "rg-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      ~ virtual_network_name                           = "vnet-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.network.azurerm_virtual_network.this must be replaced
-/+ resource "azurerm_virtual_network" "this" {
      ~ dns_servers             = [] -> (known after apply)
      - flow_timeout_in_minutes = 0 -> null
      ~ guid                    = "a57f2f5c-bf2d-4771-b21e-44bd81de7186" -> (known after apply)
      ~ id                      = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/virtualNetworks/vnet-hub-scenario1-wus3" -> (known after apply)
      ~ name                    = "vnet-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement
      ~ resource_group_name     = "rg-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement
      ~ subnet                  = [
          - {
              - address_prefix = "10.242.0.0/26"
              - id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/virtualNetworks/vnet-hub-scenario1-wus3/subnets/AzureFirewallSubnet"
              - name           = "AzureFirewallSubnet"
              - security_group = ""
            },
          - {
              - address_prefix = "10.242.0.64/26"
              - id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/virtualNetworks/vnet-hub-scenario1-wus3/subnets/AzureBastionSubnet"
              - name           = "AzureBastionSubnet"
              - security_group = ""
            },
        ] -> (known after apply)
      ~ tags                    = {
          + "Environment" = "prod"
          + "Owner"       = "cloudops@contoso.com"
          + "Project"     = "[Scenario 1: HUB] App Service Landing Zone Accelerator"
          + "Terraform"   = "true"
          + "module"      = "network"
        }
        # (2 unchanged attributes hidden)
    }

Plan: 21 to add, 0 to change, 21 to destroy.

Changes to Outputs:
  ~ bastion_name        = "bast-hub-scenario1-wus3" -> (known after apply)
  ~ firewall_private_ip = "10.242.0.4" -> (known after apply)
  ~ firewall_rules      = {
      ~ azure_monitor         = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/azureFirewalls/fw-hub-scenario1-wus3/applicationRuleCollections/Azure-Monitor-FQDNs" -> (known after apply)
      ~ core                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/azureFirewalls/fw-hub-scenario1-wus3/applicationRuleCollections/Core-Dependencies-FQDNs" -> (known after apply)
      ~ windows_vm_devops     = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/azureFirewalls/fw-hub-scenario1-wus3/applicationRuleCollections/Devops-VM-Dependencies-FQDNs" -> (known after apply)
      ~ windows_vm_devops_net = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/azureFirewalls/fw-hub-scenario1-wus3/networkRuleCollections/Windows-VM-Connectivity-Requirements" -> (known after apply)
    }
  ~ rg_name             = "rg-hub-scenario1-wus3" -> (known after apply)
  ~ vnet_id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/virtualNetworks/vnet-hub-scenario1-wus3" -> (known after apply)
  ~ vnet_name           = "vnet-hub-scenario1-wus3" -> (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # module.network.azurerm_virtual_network.this has changed%0A  ~ resource "azurerm_virtual_network" "this" {%0A        id                      = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/virtualNetworks/vnet-hub-scenario1-wus3"%0A        name                    = "vnet-hub-scenario1-wus3"%0A      ~ subnet                  = [%0A          + {%0A              + address_prefix = "10.242.0.0/26"%0A              + id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/virtualNetworks/vnet-hub-scenario1-wus3/subnets/AzureFirewallSubnet"%0A              + name           = "AzureFirewallSubnet"%0A              + security_group = ""%0A            },%0A          + {%0A              + address_prefix = "10.242.0.64/26"%0A              + id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/virtualNetworks/vnet-hub-scenario1-wus3/subnets/AzureBastionSubnet"%0A              + name           = "AzureBastionSubnet"%0A              + security_group = ""%0A            },%0A        ]%0A      + tags                    = {}%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  - destroy%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # azurecaf_name.bastion_host will be destroyed%0A  # (because azurecaf_name.bastion_host is not in configuration)%0A  - resource "azurecaf_name" "bastion_host" {%0A      - clean_input   = true -> null%0A      - id            = "gggewsruqgiwnjwa" -> null%0A      - name          = "hub-scenario1" -> null%0A      - passthrough   = false -> null%0A      - random_length = 0 -> null%0A      - resource_type = "azurerm_bastion_host" -> null%0A      - result        = "bast-hub-scenario1-wus3" -> null%0A      - results       = {} -> null%0A      - separator     = "-" -> null%0A      - suffixes      = [%0A          - "wus3",%0A        ] -> null%0A      - use_slug      = true -> null%0A    }%0A%0A  # azurecaf_name.caf_name_hub_rg will be created%0A  + resource "azurecaf_name" "caf_name_hub_rg" {%0A      + clean_input   = true%0A      + id            = (known after apply)%0A      + name          = "eslz2"%0A      + passthrough   = false%0A      + prefixes      = [%0A          + "sec-baseline-1-hub",%0A          + "westus3",%0A        ]%0A      + random_length = 0%0A      + resource_type = "azurerm_resource_group"%0A      + result        = (known after apply)%0A      + results       = (known after apply)%0A      + separator     = "-"%0A      + use_slug      = true%0A    }%0A%0A  # azurecaf_name.firewall will be destroyed%0A  # (because azurecaf_name.firewall is not in configuration)%0A  - resource "azurecaf_name" "firewall" {%0A      - clean_input   = true -> null%0A      - id            = "atqhstfaibxdnjav" -> null%0A      - name          = "hub-scenario1" -> null%0A      - passthrough   = false -> null%0A      - random_length = 0 -> null%0A      - resource_type = "azurerm_firewall" -> null%0A      - result        = "fw-hub-scenario1-wus3" -> null%0A      - results       = {} -> null%0A      - separator     = "-" -> null%0A      - suffixes      = [%0A          - "wus3",%0A        ] -> null%0A      - use_slug      = true -> null%0A    }%0A%0A  # azurecaf_name.law will be destroyed%0A  # (because azurecaf_name.law is not in configuration)%0A  - resource "azurecaf_name" "law" {%0A      - clean_input   = true -> null%0A      - id            = "fqnobcgpjpovkway" -> null%0A      - name          = "hub-scenario1" -> null%0A      - passthrough   = false -> null%0A      - random_length = 0 -> null%0A      - resource_type = "azurerm_log_analytics_workspace" -> null%0A      - result        = "log-hub-scenario1-wus3" -> null%0A      - results       = {} -> null%0A      - separator     = "-" -> null%0A      - suffixes      = [%0A          - "wus3",%0A        ] -> null%0A      - use_slug      = true -> null%0A    }%0A%0A  # azurecaf_name.resource_group will be destroyed%0A  # (because azurecaf_name.resource_group is not in configuration)%0A  - resource "azurecaf_name" "resource_group" {%0A      - clean_input   = true -> null%0A      - id            = "sdhamjahaycopevr" -> null%0A      - name          = "hub-scenario1" -> null%0A      - passthrough   = false -> null%0A      - random_length = 0 -> null%0A      - resource_type = "azurerm_resource_group" -> null%0A      - result        = "rg-hub-scenario1-wus3" -> null%0A      - results       = {} -> null%0A      - separator     = "-" -> null%0A      - suffixes      = [%0A          - "wus3",%0A        ] -> null%0A      - use_slug      = true -> null%0A    }%0A%0A  # azurecaf_name.vnet will be destroyed%0A  # (because azurecaf_name.vnet is not in configuration)%0A  - resource "azurecaf_name" "vnet" {%0A      - clean_input   = true -> null%0A      - id            = "eayygfcnmpfqsowx" -> null%0A      - name          = "hub-scenario1" -> null%0A      - passthrough   = false -> null%0A      - random_length = 0 -> null%0A      - resource_type = "azurerm_virtual_network" -> null%0A      - result        = "vnet-hub-scenario1-wus3" -> null%0A      - results       = {} -> null%0A      - separator     = "-" -> null%0A      - suffixes      = [%0A          - "wus3",%0A        ] -> null%0A      - use_slug      = true -> null%0A    }%0A%0A  # azurerm_log_analytics_workspace.law will be destroyed%0A  # (because azurerm_log_analytics_workspace.law is not in configuration)%0A  - resource "azurerm_log_analytics_workspace" "law" {%0A      - allow_resource_only_permissions = true -> null%0A      - cmk_for_query_forced            = false -> null%0A      - daily_quota_gb                  = -1 -> null%0A      - id                              = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.OperationalInsights/workspaces/log-hub-scenario1-wus3" -> null%0A      - internet_ingestion_enabled      = true -> null%0A      - internet_query_enabled          = true -> null%0A      - local_authentication_disabled   = false -> null%0A      - location                        = "westus3" -> null%0A      - name                            = "log-hub-scenario1-wus3" -> null%0A      - primary_shared_key              = (sensitive value) -> null%0A      - resource_group_name             = "rg-hub-scenario1-wus3" -> null%0A      - retention_in_days               = 30 -> null%0A      - secondary_shared_key            = (sensitive value) -> null%0A      - sku                             = "PerGB2018" -> null%0A      - tags                            = {} -> null%0A      - workspace_id                    = "2b9150ce-64a2-4a6d-885e-cd7dfd9e8153" -> null%0A    }%0A%0A  # azurerm_resource_group.hub must be replaced%0A-/+ resource "azurerm_resource_group" "hub" {%0A      ~ id       = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3" -> (known after apply)%0A      ~ name     = "rg-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement%0A      ~ tags     = {%0A          + "Environment" = "prod"%0A          + "Owner"       = "cloudops@contoso.com"%0A          + "Project"     = "[Scenario 1: HUB] App Service Landing Zone Accelerator"%0A          + "Terraform"   = "true"%0A          - "terraform"   = "true" -> null%0A        }%0A        # (1 unchanged attribute hidden)%0A    }%0A%0A  # module.bastion[0].azurecaf_name.bastion_pip will be destroyed%0A  # (because azurecaf_name.bastion_pip is not in configuration)%0A  - resource "azurecaf_name" "bastion_pip" {%0A      - clean_input   = true -> null%0A      - id            = "qwntecdiprlwaonl" -> null%0A      - name          = "bast-hub-scenario1-wus3" -> null%0A      - passthrough   = false -> null%0A      - random_length = 0 -> null%0A      - resource_type = "azurerm_public_ip" -> null%0A      - result        = "pip-bast-hub-scenario1-wus3" -> null%0A      - results       = {} -> null%0A      - separator     = "-" -> null%0A      - use_slug      = true -> null%0A    }%0A%0A  # module.bastion[0].azurecaf_name.caf_name_bastion will be created%0A  + resource "azurecaf_name" "caf_name_bastion" {%0A      + clean_input   = true%0A      + id            = (known after apply)%0A      + name          = "eslz2"%0A      + passthrough   = false%0A      + prefixes      = [%0A          + "sec-baseline-1-hub",%0A          + "westus3",%0A        ]%0A      + random_length = 0%0A      + resource_type = "azurerm_virtual_network"%0A      + result        = (known after apply)%0A      + results       = (known after apply)%0A      + separator     = "-"%0A      + use_slug      = true%0A    }%0A%0A  # module.bastion[0].azurecaf_name.caf_name_pip will be created%0A  + resource "azurecaf_name" "caf_name_pip" {%0A      + clean_input   = true%0A      + id            = (known after apply)%0A      + name          = "eslz2"%0A      + passthrough   = false%0A      + prefixes      = [%0A          + "sec-baseline-1-hub",%0A          + "westus3",%0A        ]%0A      + random_length = 0%0A      + resource_type = "azurerm_public_ip"%0A      + result        = (known after apply)%0A      + results       = (known after apply)%0A      + separator     = "-"%0A      + use_slug      = true%0A    }%0A%0A  # module.bastion[0].azurerm_bastion_host.bastion must be replaced%0A-/+ resource "azurerm_bastion_host" "bastion" {%0A      ~ dns_name               = "bst-69efc60e-54e0-4ac8-b44f-4347f67dc108.bastion.azure.com" -> (known after apply)%0A      ~ id                     = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/bastionHosts/bast-hub-scenario1-wus3" -> (known after apply)%0A      ~ name                   = "bast-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement%0A      ~ resource_group_name    = "rg-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement%0A      ~ tags                   = {%0A          + "Environment" = "prod"%0A          + "Owner"       = "cloudops@contoso.com"%0A          + "Project"     = "[Scenario 1: HUB] App Service Landing Zone Accelerator"%0A          + "Terraform"   = "true"%0A          + "module"      = "bastion"%0A        }%0A        # (8 unchanged attributes hidden)%0A%0A      ~ ip_configuration {%0A            name                 = "bastionHostIpConfiguration"%0A          ~ public_ip_address_id = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/publicIPAddresses/pip-bast-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement%0A          ~ subnet_id            = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/virtualNetworks/vnet-hub-scenario1-wus3/subnets/AzureBastionSubnet" # forces replacement -> (known after apply) # forces replacement%0A        }%0A    }%0A%0A  # module.bastion[0].azurerm_public_ip.bastion_pip must be replaced%0A-/+ resource "azurerm_public_ip" "bastion_pip" {%0A      + fqdn                    = (known after apply)%0A      ~ id                      = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/publicIPAddresses/pip-bast-hub-scenario1-wus3" -> (known after apply)%0A      ~ ip_address              = "20.25.144.65" -> (known after apply)%0A      - ip_tags                 = {} -> null%0A      ~ name                    = "pip-bast-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement%0A      ~ resource_group_name     = "rg-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement%0A      ~ tags                    = {%0A          + "Environment" = "prod"%0A          + "Owner"       = "cloudops@contoso.com"%0A          + "Project"     = "[Scenario 1: HUB] App Service Landing Zone Accelerator"%0A          + "Terraform"   = "true"%0A          + "module"      = "bastion"%0A        }%0A      - zones                   = [] -> null%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.firewall[0].azurecaf_name.caf_name_firewall will be created%0A  + resource "azurecaf_name" "caf_name_firewall" {%0A      + clean_input   = true%0A      + id            = (known after apply)%0A      + name          = "eslz2"%0A      + passthrough   = false%0A      + prefixes      = [%0A          + "sec-baseline-1-hub",%0A          + "westus3",%0A        ]%0A      + random_length = 0%0A      + resource_type = "azurerm_firewall"%0A      + result        = (known after apply)%0A      + results       = (known after apply)%0A      + separator     = "-"%0A      + use_slug      = true%0A    }%0A%0A  # module.firewall[0].azurecaf_name.caf_name_law[0] will be created%0A  + resource "azurecaf_name" "caf_name_law" {%0A      + clean_input   = true%0A      + id            = (known after apply)%0A      + name          = "eslz2"%0A      + passthrough   = false%0A      + prefixes      = [%0A          + "sec-baseline-1-hub",%0A          + "westus3",%0A        ]%0A      + random_length = 0%0A      + resource_type = "azurerm_log_analytics_workspace"%0A      + result        = (known after apply)%0A      + results       = (known after apply)%0A      + separator     = "-"%0A      + use_slug      = true%0A    }%0A%0A  # module.firewall[0].azurecaf_name.caf_name_pip will be created%0A  + resource "azurecaf_name" "caf_name_pip" {%0A      + clean_input   = true%0A      + id            = (known after apply)%0A      + name          = "eslz2"%0A      + passthrough   = false%0A      + prefixes      = [%0A          + "sec-baseline-1-hub",%0A          + "westus3",%0A        ]%0A      + random_length = 0%0A      + resource_type = "azurerm_public_ip"%0A      + result        = (known after apply)%0A      + results       = (known after apply)%0A      + separator     = "-"%0A      + use_slug      = true%0A    }%0A%0A  # module.firewall[0].azurecaf_name.firewall_pip will be destroyed%0A  # (because azurecaf_name.firewall_pip is not in configuration)%0A  - resource "azurecaf_name" "firewall_pip" {%0A      - clean_input   = true -> null%0A      - id            = "buncvpcbdyqgwdik" -> null%0A      - name          = "fw-hub-scenario1-wus3" -> null%0A      - passthrough   = false -> null%0A      - random_length = 0 -> null%0A      - resource_type = "azurerm_public_ip" -> null%0A      - result        = "pip-fw-hub-scenario1-wus3" -> null%0A      - results       = {} -> null%0A      - separator     = "-" -> null%0A      - use_slug      = true -> null%0A    }%0A%0A  # module.firewall[0].azurerm_firewall.firewall must be replaced%0A-/+ resource "azurerm_firewall" "firewall" {%0A      - dns_servers         = [] -> null%0A      ~ id                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/azureFirewalls/fw-hub-scenario1-wus3" -> (known after apply)%0A      ~ name                = "fw-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement%0A      - private_ip_ranges   = [] -> null%0A      ~ resource_group_name = "rg-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement%0A      ~ tags                = {%0A          + "Environment" = "prod"%0A          + "Owner"       = "cloudops@contoso.com"%0A          + "Project"     = "[Scenario 1: HUB] App Service Landing Zone Accelerator"%0A          + "Terraform"   = "true"%0A          + "module"      = "firewall"%0A        }%0A      ~ threat_intel_mode   = "Alert" -> (known after apply)%0A      - zones               = [] -> null%0A        # (3 unchanged attributes hidden)%0A%0A      ~ ip_configuration {%0A            name                 = "firewallIpConfiguration"%0A          ~ private_ip_address   = "10.242.0.4" -> (known after apply)%0A          ~ public_ip_address_id = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/publicIPAddresses/pip-fw-hub-scenario1-wus3" -> (known after apply)%0A          ~ subnet_id            = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/virtualNetworks/vnet-hub-scenario1-wus3/subnets/AzureFirewallSubnet" # forces replacement -> (known after apply) # forces replacement%0A        }%0A    }%0A%0A  # module.firewall[0].azurerm_firewall_application_rule_collection.azure_monitor must be replaced%0A-/+ resource "azurerm_firewall_application_rule_collection" "azure_monitor" {%0A      ~ azure_firewall_name = "fw-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement%0A      ~ id                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/azureFirewalls/fw-hub-scenario1-wus3/applicationRuleCollections/Azure-Monitor-FQDNs" -> (known after apply)%0A        name                = "Azure-Monitor-FQDNs"%0A      ~ resource_group_name = "rg-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement%0A        # (2 unchanged attributes hidden)%0A%0A      ~ rule {%0A          - fqdn_tags        = [] -> null%0A            name             = "allow-azure-monitor"%0A          - source_ip_groups = [] -> null%0A            # (2 unchanged attributes hidden)%0A%0A            # (1 unchanged block hidden)%0A        }%0A    }%0A%0A  # module.firewall[0].azurerm_firewall_application_rule_collection.core must be replaced%0A-/+ resource "azurerm_firewall_application_rule_collection" "core" {%0A      ~ azure_firewall_name = "fw-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement%0A      ~ id                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/azureFirewalls/fw-hub-scenario1-wus3/applicationRuleCollections/Core-Dependencies-FQDNs" -> (known after apply)%0A        name                = "Core-Dependencies-FQDNs"%0A      ~ resource_group_name = "rg-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement%0A        # (2 unchanged attributes hidden)%0A%0A      ~ rule {%0A          - fqdn_tags        = [] -> null%0A            name             = "allow-core-apis"%0A          - source_ip_groups = [] -> null%0A            # (2 unchanged attributes hidden)%0A%0A            # (1 unchanged block hidden)%0A        }%0A      ~ rule {%0A          - fqdn_tags        = [] -> null%0A            name             = "allow-developer-services"%0A          - source_ip_groups = [] -> null%0A            # (2 unchanged attributes hidden)%0A%0A            # (1 unchanged block hidden)%0A        }%0A      ~ rule {%0A          - fqdn_tags        = [] -> null%0A            name             = "allow-certificate-dependencies"%0A          - source_ip_groups = [] -> null%0A            # (2 unchanged attributes hidden)%0A%0A            # (1 unchanged block hidden)%0A        }%0A    }%0A%0A  # module.firewall[0].azurerm_firewall_application_rule_collection.windows_vm_devops must be replaced%0A-/+ resource "azurerm_firewall_application_rule_collection" "windows_vm_devops" {%0A      ~ azure_firewall_name = "fw-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement%0A      ~ id                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/azureFirewalls/fw-hub-scenario1-wus3/applicationRuleCollections/Devops-VM-Dependencies-FQDNs" -> (known after apply)%0A        name                = "Devops-VM-Dependencies-FQDNs"%0A      ~ resource_group_name = "rg-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement%0A        # (2 unchanged attributes hidden)%0A%0A      ~ rule {%0A          - fqdn_tags        = [] -> null%0A            name             = "allow-azure-ad-join"%0A          - source_ip_groups = [] -> null%0A            # (2 unchanged attributes hidden)%0A%0A            # (1 unchanged block hidden)%0A        }%0A      ~ rule {%0A          - fqdn_tags        = [] -> null%0A            name             = "allow-vm-dependencies-and-tools"%0A          - source_ip_groups = [] -> null%0A            # (2 unchanged attributes hidden)%0A%0A            # (1 unchanged block hidden)%0A        }%0A    }%0A%0A  # module.firewall[0].azurerm_firewall_network_rule_collection.windows_vm_devops must be replaced%0A-/+ resource "azurerm_firewall_network_rule_collection" "windows_vm_devops" {%0A      ~ azure_firewall_name = "fw-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement%0A      ~ id                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/azureFirewalls/fw-hub-scenario1-wus3/networkRuleCollections/Windows-VM-Connectivity-Requirements" -> (known after apply)%0A        name                = "Windows-VM-Connectivity-Requirements"%0A      ~ resource_group_name = "rg-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement%0A        # (2 unchanged attributes hidden)%0A%0A      ~ rule {%0A          - destination_fqdns     = [] -> null%0A          - destination_ip_groups = [] -> null%0A            name                  = "allow-kms-activation"%0A          - source_ip_groups      = [] -> null%0A            # (4 unchanged attributes hidden)%0A        }%0A      ~ rule {%0A          - destination_fqdns     = [] -> null%0A          - destination_ip_groups = [] -> null%0A            name                  = "allow-ntp"%0A          - source_ip_groups      = [] -> null%0A            # (4 unchanged attributes hidden)%0A        }%0A    }%0A%0A  # module.firewall[0].azurerm_log_analytics_workspace.law[0] will be created%0A  + resource "azurerm_log_analytics_workspace" "law" {%0A      + allow_resource_only_permissions    = true%0A      + daily_quota_gb                     = -1%0A      + id                                 = (known after apply)%0A      + internet_ingestion_enabled         = true%0A      + internet_query_enabled             = true%0A      + local_authentication_disabled      = false%0A      + location                           = "westus3"%0A      + name                               = (known after apply)%0A      + primary_shared_key                 = (sensitive value)%0A      + reservation_capacity_in_gb_per_day = (known after apply)%0A      + resource_group_name                = (known after apply)%0A      + retention_in_days                  = (known after apply)%0A      + secondary_shared_key               = (sensitive value)%0A      + sku                                = "PerGB2018"%0A      + workspace_id                       = (known after apply)%0A    }%0A%0A  # module.firewall[0].azurerm_monitor_diagnostic_setting.this must be replaced%0A-/+ resource "azurerm_monitor_diagnostic_setting" "this" {%0A      ~ id                             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/azureFirewalls/fw-hub-scenario1-wus3|fw-hub-scenario1-wus3-diagnostic-settings" -> (known after apply)%0A      ~ log_analytics_destination_type = "AzureDiagnostics" -> (known after apply)%0A      ~ log_analytics_workspace_id     = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.OperationalInsights/workspaces/log-hub-scenario1-wus3" -> (known after apply)%0A      ~ name                           = "fw-hub-scenario1-wus3-diagnostic-settings" # forces replacement -> (known after apply) # forces replacement%0A      ~ target_resource_id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/azureFirewalls/fw-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement%0A%0A      - log {%0A          - category_group = "allLogs" -> null%0A          - enabled        = true -> null%0A%0A          - retention_policy {%0A              - days    = 0 -> null%0A              - enabled = false -> null%0A            }%0A        }%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.firewall[0].azurerm_public_ip.firewall_pip must be replaced%0A-/+ resource "azurerm_public_ip" "firewall_pip" {%0A      + fqdn                    = (known after apply)%0A      ~ id                      = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/publicIPAddresses/pip-fw-hub-scenario1-wus3" -> (known after apply)%0A      ~ ip_address              = "20.25.144.42" -> (known after apply)%0A      - ip_tags                 = {} -> null%0A      ~ name                    = "pip-fw-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement%0A      ~ resource_group_name     = "rg-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement%0A      ~ tags                    = {%0A          + "Environment" = "prod"%0A          + "Owner"       = "cloudops@contoso.com"%0A          + "Project"     = "[Scenario 1: HUB] App Service Landing Zone Accelerator"%0A          + "Terraform"   = "true"%0A          + "module"      = "firewall"%0A        }%0A      - zones                   = [] -> null%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.network.azurecaf_name.caf_name_vnet will be created%0A  + resource "azurecaf_name" "caf_name_vnet" {%0A      + clean_input   = true%0A      + id            = (known after apply)%0A      + name          = "eslz2"%0A      + passthrough   = false%0A      + prefixes      = [%0A          + "sec-baseline-1-hub",%0A          + "westus3",%0A        ]%0A      + random_length = 0%0A      + resource_type = "azurerm_virtual_network"%0A      + result        = (known after apply)%0A      + results       = (known after apply)%0A      + separator     = "-"%0A      + suffixes      = [%0A          + "prod",%0A        ]%0A      + use_slug      = true%0A    }%0A%0A  # module.network.azurerm_subnet.this[0] must be replaced%0A-/+ resource "azurerm_subnet" "this" {%0A      ~ enforce_private_link_endpoint_network_policies = false -> (known after apply)%0A      ~ enforce_private_link_service_network_policies  = false -> (known after apply)%0A      ~ id                                             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/virtualNetworks/vnet-hub-scenario1-wus3/subnets/AzureFirewallSubnet" -> (known after apply)%0A        name                                           = "AzureFirewallSubnet"%0A      ~ private_endpoint_network_policies_enabled      = true -> (known after apply)%0A      ~ private_link_service_network_policies_enabled  = true -> (known after apply)%0A      ~ resource_group_name                            = "rg-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement%0A      - service_endpoint_policy_ids                    = [] -> null%0A      - service_endpoints                              = [] -> null%0A      ~ virtual_network_name                           = "vnet-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement%0A        # (1 unchanged attribute hidden)%0A    }%0A%0A  # module.network.azurerm_subnet.this[1] must be replaced%0A-/+ resource "azurerm_subnet" "this" {%0A      ~ enforce_private_link_endpoint_network_policies = false -> (known after apply)%0A      ~ enforce_private_link_service_network_policies  = false -> (known after apply)%0A      ~ id                                             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/virtualNetworks/vnet-hub-scenario1-wus3/subnets/AzureBastionSubnet" -> (known after apply)%0A        name                                           = "AzureBastionSubnet"%0A      ~ private_endpoint_network_policies_enabled      = true -> (known after apply)%0A      ~ private_link_service_network_policies_enabled  = true -> (known after apply)%0A      ~ resource_group_name                            = "rg-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement%0A      - service_endpoint_policy_ids                    = [] -> null%0A      - service_endpoints                              = [] -> null%0A      ~ virtual_network_name                           = "vnet-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement%0A        # (1 unchanged attribute hidden)%0A    }%0A%0A  # module.network.azurerm_virtual_network.this must be replaced%0A-/+ resource "azurerm_virtual_network" "this" {%0A      ~ dns_servers             = [] -> (known after apply)%0A      - flow_timeout_in_minutes = 0 -> null%0A      ~ guid                    = "a57f2f5c-bf2d-4771-b21e-44bd81de7186" -> (known after apply)%0A      ~ id                      = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/virtualNetworks/vnet-hub-scenario1-wus3" -> (known after apply)%0A      ~ name                    = "vnet-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement%0A      ~ resource_group_name     = "rg-hub-scenario1-wus3" # forces replacement -> (known after apply) # forces replacement%0A      ~ subnet                  = [%0A          - {%0A              - address_prefix = "10.242.0.0/26"%0A              - id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/virtualNetworks/vnet-hub-scenario1-wus3/subnets/AzureFirewallSubnet"%0A              - name           = "AzureFirewallSubnet"%0A              - security_group = ""%0A            },%0A          - {%0A              - address_prefix = "10.242.0.64/26"%0A              - id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/virtualNetworks/vnet-hub-scenario1-wus3/subnets/AzureBastionSubnet"%0A              - name           = "AzureBastionSubnet"%0A              - security_group = ""%0A            },%0A        ] -> (known after apply)%0A      ~ tags                    = {%0A          + "Environment" = "prod"%0A          + "Owner"       = "cloudops@contoso.com"%0A          + "Project"     = "[Scenario 1: HUB] App Service Landing Zone Accelerator"%0A          + "Terraform"   = "true"%0A          + "module"      = "network"%0A        }%0A        # (2 unchanged attributes hidden)%0A    }%0A%0APlan: 21 to add, 0 to change, 21 to destroy.%0A%0AChanges to Outputs:%0A  ~ bastion_name        = "bast-hub-scenario1-wus3" -> (known after apply)%0A  ~ firewall_private_ip = "10.242.0.4" -> (known after apply)%0A  ~ firewall_rules      = {%0A      ~ azure_monitor         = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/azureFirewalls/fw-hub-scenario1-wus3/applicationRuleCollections/Azure-Monitor-FQDNs" -> (known after apply)%0A      ~ core                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/azureFirewalls/fw-hub-scenario1-wus3/applicationRuleCollections/Core-Dependencies-FQDNs" -> (known after apply)%0A      ~ windows_vm_devops     = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/azureFirewalls/fw-hub-scenario1-wus3/applicationRuleCollections/Devops-VM-Dependencies-FQDNs" -> (known after apply)%0A      ~ windows_vm_devops_net = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/azureFirewalls/fw-hub-scenario1-wus3/networkRuleCollections/Windows-VM-Connectivity ...
```

</details>
Output is too long and was truncated. You can read full Plan in <a href="https://github.com/Azure/appservice-landing-zone-accelerator/actions/runs/5707809097">Actions</a>.<br /><br />

*Pusher: @JinLee794, Action: `pull_request`, Working Directory: `scenarios/secure-baseline-multitenant/terraform/hub`, Workflow: `Scenario 1: Terraform HUB Multi-tenant Secure Baseline`*